nxp-mcuxpresso/mcux-soc-svd/MCXN546/MCXN546_cm33_core0.xml
        <register>
          <name>R_DFT_CTRL</name>
          <description>BIST DFT Control Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFT_XADR</name>
              <description>DFT XADR Pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz252</name>
                  <description>XADR fixed, no change at all</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz253</name>
                  <description>XADR increased by 1 after row. For READ operation, XADR increases by 1 after reading the last word of row. For PROG operation, XADR increases by 1 after NVSTR falls.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz254</name>
                  <description>XADR increased for diagonal. For PROG-DIAGONAL operation, XADR is increased to create diagonal pattern.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz255</name>
                  <description>XADR increased by sector. During ERASE operation, XADR increased by number of rows in a sector when NVSTR falls.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz256</name>
                  <description>XADR inversed. XADR is inversed after reading one word or after programming one row when NVSTR falls.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz257</name>
                  <description>XADR increased by 2 after row. For READ operation, XADR is increased by 2 after reading the last word of a row. For PROG operation, XADR is increased by 2 when NVSTR falls.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz258</name>
                  <description>XADR[0] inversed. XADR[0] is inversed after reading one word or after programming one row when NVSTR falls.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz259</name>
                  <description>XADR increased by 1. For READ operations only, XADR increased by 1 after each read cycle.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz260</name>
                  <description>XADR decreased by 1 after row. For READ operations only, XADR is decreased by 1 after YADR decreases to 0.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz261</name>
                  <description>XADR decreased by 1. For READ operations only, XADR is decreased by 1 after each read cycle.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_YADR</name>
              <description>DFT YADR Pattern</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz242</name>
                  <description>YADR fixed, no change at all</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz243</name>
                  <description>YADR for ICKBD. For PROG and READ operations, YADR changed to generate inverse checkerboard pattern.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz244</name>
                  <description>YADR for CKBD. For PROG and READ operations, YADR changed to generate checkerboard pattern.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz245</name>
                  <description>YADR increased by 1. For READ operations, YADR increased by 1 after each read cycle. For PROG operations, YADR increased by 1 after YE falls.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz246</name>
                  <description>YADR increased for diagonal. For PROG-DIAGONAL operation, YADR is increased to create diagonal pattern.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz247</name>
                  <description>YADR inversed. YADR is inversed after reading one word or after programming one word when YE falls.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz248</name>
                  <description>YADR[0] inversed. YADR[0] is inversed after reading one word or after programming one word when YE falls.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz249</name>
                  <description>YADR increased by 1 after last row. For READ operations only, YADR is increased by 1 after XADR reaches last row.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz250</name>
                  <description>YADR decreased by 1. For READ operations only, YADR is decreased by 1 after each read cycle.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz251</name>
                  <description>YADR decreased by 1 after first row. For READ operations only, YADR is decreased by 1 after XADR decreases to 0.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DATA</name>
              <description>DFT Data Pattern</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz232</name>
                  <description>CKBD pattern. For READ operations only, compare DOUT with checkerboard data pattern for each read cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz233</name>
                  <description>ICKBD pattern. For READ operations only, compare DOUT with inverse checkerboard data pattern for each read cycle.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz234</name>
                  <description>Diagonal pattern. Used for READ operations only, compare DOUT to diagonal pattern.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz235</name>
                  <description>Fixed data pattern. For READ operations, comparison to DOUT for selected groups; refer to R_ADR_CTRL[GRPSEL] for modules with multiple groups.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz236</name>
                  <description>Random data pattern which will be generated based on the initial seed set in R_DATA; for READ operations, used for DOUT comparison of selected groups. For PROG operations, used to control DIN of selected groups.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz237</name>
                  <description>DOUT based pattern. For READ operations only, DOUT of selected group will be latched in R_DATA. If more than one group is selected in R_ADR_CTRL[GRPSEL], the group with the lower index will be latched.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz238</name>
                  <description>R_DATA based pattern. For READ operations, expected DOUT value of selected groups equals to R_DATA when XADR[0]==YADR[0] or ~R_DATA when XADR[0]!=YADR[0]. For PROG operations, DIN of selected groups equals R_DATA when XADR[0]==YADR[0] or ~R_DATA when XADR[0]!=YADR[0].</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz239</name>
                  <description>SCAN-IO pattern. For READ operations, control expected DOUT value of selected groups to SCAN-IO data pattern. For PROG operations, control DIN of selected groups to SCAN-IO data pattern.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz240</name>
                  <description>REPAIR set. For PROG operation to IFR1(7,1) and IFR1(7,2), R_REPAIR0_0 and R_REPAIR0_1 or R_REPAIR1_0 and R_REPAIR1_1 will control DIN. For READ operation on IFR1(7,1) and IFR1(7,2), DOUT will be compared against R_REPAIR0_0 and R_REPAIR0_1 or R_REPAIR1_0 andR_REPAIR1_1. When this option is selected, only one flash block can be selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz241</name>
                  <description>REPAIR load. For READ operation only, DOUT from IFR1(7,1) and IFR1(7,2) is loaded to R_REPAIR0 and R_REPAIR1.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP_MASK</name>
              <description>Data Compare Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz229</name>
                  <description>Expected data is compared to DOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz230</name>
                  <description>Expected data (only 0s are considered) are compared to DOUT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz231</name>
                  <description>Expected data (only 1s are considered) are compared to DOUT</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DATA_SRC</name>
              <description>DFT Data Source</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz227</name>
                  <description>{R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0} is used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz228</name>
                  <description>{R_DATA_CTRL3,R_DATA_CTRL2_EX[2:0],R_DATA_CTRL2,R_DATA_CTRL1_EX[2:0],R_DATA_CTRL1,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0} is used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>R_ADR_CTRL</name>
          <description>BIST Address Control Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRPSEL</name>
              <description>Data Group Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz270</name>
                  <description>Select no data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz271</name>
                  <description>Select data slice [34:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz272</name>
                  <description>Select data slice [69:35]</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz273</name>
                  <description>Select data slice [104:70]</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz274</name>
                  <description>Select data slice [136:105]</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz275</name>
                  <description>Select data [136:0]</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XADR</name>
              <description>BIST XADR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YADR</name>
              <description>BIST YADR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROG_ATTR</name>
              <description>Program Attribute</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz262</name>
                  <description>One YE pulse will program one data slice group</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz263</name>
                  <description>One YE pulse will program two data slice groups</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz264</name>
                  <description>One YE pulse will program three data slice groups (reserved)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz265</name>
                  <description>One YE pulse will program four data slice groups</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz266</name>
                  <description>One YE pulse will program five data slice groups (reserved)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz267</name>
                  <description>One YE pulse will program six data slice groups (reserved)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz268</name>
                  <description>One YE pulse will program seven data slice groups (reserved)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz269</name>
                  <description>One YE pulse will program eight data slice groups (reserved)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL0</name>
          <description>BIST Data Control 0 Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>BIST Data 0 Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_PIN_CTRL</name>
          <description>BIST Pin Control Register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAS1</name>
              <description>Mass Erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFREN</name>
              <description>IFR Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFREN1</name>
              <description>IFR1 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDEN</name>
              <description>Redundancy Block Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVE</name>
              <description>Low Voltage Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PV</name>
              <description>Program Verify Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV</name>
              <description>Erase Verify Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIPGM</name>
              <description>Program Current</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHV</name>
              <description>High Voltage Level</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMV</name>
              <description>Medium Voltage Level</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XE</name>
              <description>X Address Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YE</name>
              <description>Y Address Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE</name>
              <description>Sense Amp Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERASE</name>
              <description>Erase Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROG</name>
              <description>Program Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NVSTR</name>
              <description>NVM Store</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLM</name>
              <description>Sleep Mode Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECALL</name>
              <description>Recall Trim Code</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEM</name>
              <description>HEM Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
